{
    "schema": {
        "name": "Name of the location. Should be generic and not an actual proper name.",
        "description": "Description of what the location is, as well as the dangers and opportunities it presents.",
        "category": "What type of location it is.",
        "atmosphere": "A short and punchy description of the atmosphere of the location that doesn't repeat details from the \"description\" field. Should be evocative and not too long. This should try to include 1. What sounds can be heard? 2. What scents can be smelled? 3. What visual activity is happening? 4. What objects and clutter are lying around or visible that are unique to this place? 5. What small visual details are noticed that are unique to this place? 6. What does a person physically feel while in this space that is distinct from other places, like heat, cold, dampness, etc?"
    },
    "biomes": [
        "desert",
        "bog",
        "forest",
        "jungle",
        "mountain",
        "ocean",
        "river",
        "sea",
        "swamp",
        "underwater",
        "volcanic",
        "wetland",
        "woodland"
    ],
    "categories": [
        {
            "name": "ruin",
            "description": "abandoned places where sapient beings once lived or worked"
        },
        {
            "name": "settlement",
            "description": "a place where sapient beings live"
        },
        {
            "name": "sacred_site",
            "description": "a place where sapient beings worship a deity"
        },
        {
            "name": "magical_site",
            "description": "a place where magic is present and affects the world around it"
        },
        {
            "name": "geography",
            "description": "a place that is a part of the natural world, without specific magical or supernatural elements"
        },
        {
            "name": "dungeon",
            "description": "an extensive network of tunnels and chambers, often with traps and puzzles, that is used for storage, torture, or other purposes"
        },
        {
            "name": "planar",
            "description": "a portal or crossing between planes of existence"
        }
    ]
}